:PROPERTIES:
:ID:       63fe5ecb-88be-4401-ab37-130883f89fd4
:END:
#+title: java-jdk-buffer
#+date: [2024-08-07 三]
#+last_modified:  


** new操作, get&set操作
#+BEGIN_SRC java
  var buf= IntBuffer.allocate(4);

  System.out.println(buf.position());
  System.out.println(buf.limit());
  System.out.println(buf.capacity());
 
  buf.position(1);
  buf.limit(3);
  System.out.println(buf.position());
  System.out.println(buf.limit());
  System.out.println(buf.capacity());
   
#+END_SRC

#+RESULTS:
: 0
: 4
: 4
: 1
: 3
: 4


** data get&set操作

#+BEGIN_SRC java
  var buf= IntBuffer.allocate(4);
  for (var i = 0; i < buf.capacity() - 1; i++){
    buf.put(i, 2*i + 1);
  }

  buf.position(0);
  buf.limit(buf.capacity());
  while(buf.remaining() > 0){
    System.out.println(buf.get());
  }

#+END_SRC

#+RESULTS:
: 1
: 3
: 5
: 0







** data get&set 操作 flip(), iter

#+BEGIN_SRC java
  var buffer = IntBuffer.allocate(4);
  for (var i = 0; i < buffer.capacity() - 1; i++){
    buffer.put( 2*i + 1);
  }

  buffer.flip();
  while(buffer.hasRemaining()){
    System.out.println(buffer.get());
  }
  
#+END_SRC

#+RESULTS:
: 1
: 3
: 5



** slice 操作

#+BEGIN_SRC java
   var buf = IntBuffer.allocate(4);
   for (var i = 0; i < buf.capacity(); i++){
     buf.put(i);
   }

  buf.position(1);
  buf.limit(3);
  var buf2 = buf.slice();

  while(buf2.hasRemaining()){
    System.out.println(buf2.get());
  }

#+END_SRC

#+RESULTS:
: 1
: 2







